final_project/test_cases/trial_error/salome_test/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
    inlet
    {
      type	fixedValue;
      value	uniform 18.896;
    }

    outlet
    {
      type	zeroGradient;
    }

    wing
    {
      type fixedValue;
      value uniform 17.3;
      //type epsilonWallFunction;   
      //type epsilonLowReWallFunction;
      //value uniform 0.0000000001;
      //type	zeroGradient;
    }
    sym1
    {
      type	symmetryPlane;
    }
    sym2
    {
      type	symmetryPlane;
    }
}


// ************************************************************************* //
