final_project/test_cases/trial_error/salome_test/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.0001;

boundaryField
{
    inlet
    {
      type	fixedValue;
      value	uniform 6;
    }

    outlet
    {
      type	zeroGradient;
    }

    wing
    {     
      type kLowReWallFunction;
      //type kqRWallFunction;
      value uniform 1e-10;
    }
    sym1
    {
      type	symmetryPlane;
    }
    sym2
    {
      type	symmetryPlane;
    }
}


// ************************************************************************* //
