final_project/test_cases/trial_error/salome_test/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
74080
(
0.0110657
0.0110654
0.0110655
0.0110655
0.0110655
0.0110655
0.0110655
0.0110655
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 1e-15;
    }
    outlet
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
3704
(
0.0110773
0.011081
0.0110819
0.011081
0.0110783
0.0110753
0.0110737
0.0110742
...
)
;
    }
    inlet
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
3704
(
0.0110773
0.011081
0.0110819
0.011081
0.0110783
0.0110753
0.0110737
0.0110742
...
)
;
    }
}


// ************************************************************************* //
